oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2026-09-05     RT-Thread    three-channel ADC USB microphone
 */

#include <rthw.h>
#include <rtthread.h>

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "board.h"
#include "fsl_clock.h"
#include "fsl_ctimer.h"
#include "fsl_edma.h"
#include "fsl_inputmux.h"
#include "fsl_inputmux_connections.h"
#include "fsl_lpadc.h"
#include "fsl_opamp.h"
#include "fsl_port.h"
#include "usbd_audio.h"
#include "usbd_core.h"

#if defined(RT_CHERRYUSB_DEVICE_TEMPLATE_NONE) && defined(RT_CHERRYUSB_DEVICE_AUDIO)

#define USBD_VID           0x2200
#define USBD_PID           0x0009
#define USBD_MAX_POWER     100
#define USBD_LANGID_STRING 1033

#ifdef CONFIG_USB_HS
/* HS isochronous: microframes = 2^(bInterval - 1), i.e. bInterval = log2(microframes) + 1.
 * 2^3 = 8 microframes = 1 ms matches the 16 samples per 96-byte packet, so 0x04.
 * 0x03 is 2^2 = 4 microframes = 500 us: the host polled twice per ms, so the
 * ring's 1000 blocks/s could not feed 2000 packets/s and every second packet
 * was zero-filled (see "micstat": submitted=done=2000, underrun=1000). */
#define EP_INTERVAL 0x04
#else
#define EP_INTERVAL 0x01
#endif

#define USB_ADC_MIC_SAMPLE_RATE      16000U
#define USB_ADC_MIC_CHANNELS         3U
#define USB_ADC_MIC_BYTES_PER_SAMPLE 2U
#define USB_ADC_MIC_BITS_PER_SAMPLE  16U
#define USB_ADC_MIC_SAMPLES_PER_MS   (USB_ADC_MIC_SAMPLE_RATE / 1000U)
#define USB_ADC_MIC_PACKET_BYTES     (USB_ADC_MIC_SAMPLES_PER_MS * USB_ADC_MIC_CHANNELS * USB_ADC_MIC_BYTES_PER_SAMPLE)
#define USB_ADC_MIC_AUDIO_SLOT_BYTES (USB_ADC_MIC_CHANNELS * USB_ADC_MIC_BYTES_PER_SAMPLE)
#define USB_ADC_MIC_EP_MAX_PACKET_BYTES (USB_ADC_MIC_PACKET_BYTES + USB_ADC_MIC_AUDIO_SLOT_BYTES)
#define USB_ADC_MIC_CTIMER_MATCH_RATE (USB_ADC_MIC_SAMPLE_RATE)
#define USB_ADC_MIC_TX_THREAD_STACK_SIZE 2048U
#define USB_ADC_MIC_TX_THREAD_PRIORITY   8U
#define USB_ADC_MIC_TX_THREAD_TICK       10U

#ifndef USB_ADC_MIC_USE_TEST_TONE
#define USB_ADC_MIC_USE_TEST_TONE 0
#endif

#if USB_ADC_MIC_USE_TEST_TONE
/* One tone per channel, so a mix-up between the three channels shows up as a
 * line at the wrong frequency instead of three identical traces. */
#define USB_ADC_MIC_TEST_TONE_HZ0        1000U
#define USB_ADC_MIC_TEST_TONE_HZ1        2000U
#define USB_ADC_MIC_TEST_TONE_HZ2        3000U
/* sine_16pt[] is one period of a tone sampled at the audio rate, so it can
 * serve any of the three frequencies: 1 kHz at 16 kHz is 16 samples per
 * period, so TABLE_SIZE is 16 and the 1 kHz step lands exactly on 2^28 (one
 * table point per output sample). 2 kHz and 3 kHz reuse the same table with a
 * faster step (2 and 3 table points per sample), which is why the table must
 * stay "one period" rather than "1 kHz samples".
 *
 * PHASE_SHIFT must stay 32 - log2(TABLE_SIZE) = 28: index is (phase >>
 * PHASE_SHIFT) out of a 32-bit phase, so a smaller shift would wrap the index
 * around and a larger one would only ever address the table's upper half.
 *
 * HZ * TABLE_SIZE must be a multiple of SAMPLE_RATE (enforced below), i.e. the
 * index must advance by a whole number of table points each sample. If it does
 * not, the index sequence stops being periodic and the tone picks up a comb of
 * sidebands around the fundamental: 997 Hz gave lines every ~96 Hz up to 3% of
 * the fundamental because 997 * 32 / 16000 = 1.994 instead of an integer. */
#define USB_ADC_MIC_TEST_TONE_TABLE_SIZE  16U
#define USB_ADC_MIC_TEST_TONE_PHASE_SHIFT 28U
#define USB_ADC_MIC_TEST_TONE_PHASE_STEP(hz) \
    ((uint32_t)(((uint64_t)(hz) << 32) / USB_ADC_MIC_SAMPLE_RATE))
#define USB_ADC_MIC_TEST_TONE_ADVANCE_OK(hz) \
    (((hz) * USB_ADC_MIC_TEST_TONE_TABLE_SIZE) % USB_ADC_MIC_SAMPLE_RATE == 0)

#if !USB_ADC_MIC_TEST_TONE_ADVANCE_OK(USB_ADC_MIC_TEST_TONE_HZ0) || \
    !USB_ADC_MIC_TEST_TONE_ADVANCE_OK(USB_ADC_MIC_TEST_TONE_HZ1) || \
    !USB_ADC_MIC_TEST_TONE_ADVANCE_OK(USB_ADC_MIC_TEST_TONE_HZ2)
#error "test tone: each HZ * TABLE_SIZE must be a multiple of SAMPLE_RATE, or the tone gets harmonic sidebands"
#endif

#if USB_ADC_MIC_CHANNELS > 3
#error "test tone steps are defined for 3 channels only"
#endif
#endif

#define USB_ADC_MIC_DMA_BLOCKS 8U
#define USB_ADC_MIC_PCM_BLOCKS 8U

#define AUDIO_IN_EP       0x81
#define AUDIO_IN_CLOCK_ID 0x01
#define AUDIO_IN_FU_ID    0x03

#define BMCONTROL       (AUDIO_V2_CONTROL_MUTE | AUDIO_V2_CONTROL_VOLUME)
#define INPUT_CTRL      DBVAL(BMCONTROL), DBVAL(BMCONTROL), DBVAL(BMCONTROL), DBVAL(BMCONTROL)
#define INPUT_CH_ENABLE 0x00000007

#define USB_ADC_MIC_ADC_CMD_ID     1U
#define USB_ADC_MIC_ADC_TRIGGER_ID 0U

#define USB_ADC_MIC_DMA_CHANNEL_ADC0_A 0U
#define USB_ADC_MIC_DMA_CHANNEL_ADC1_A 3U
#define USB_ADC_MIC_DMA_CHANNEL_ADC1_B 4U

#ifndef USB_ADC_MIC_USE_OPAMP
#define USB_ADC_MIC_USE_OPAMP 0
#endif

/* LPADC channel numbers for ADC0_A2 + ADC1_A0 + ADC1_B0. */
#ifndef USB_ADC_MIC_ADC0_A_CHANNEL
#define USB_ADC_MIC_ADC0_A_CHANNEL 2U
#endif

#ifndef USB_ADC_MIC_ADC1_A_CHANNEL
#define USB_ADC_MIC_ADC1_A_CHANNEL 0U
#endif

#ifndef USB_ADC_MIC_ADC1_B_CHANNEL
#define USB_ADC_MIC_ADC1_B_CHANNEL 0U
#endif

#ifndef USB_ADC_MIC_OPAMP_GAIN
#define USB_ADC_MIC_OPAMP_GAIN kOPAMP_PosGainNonInvert1X
#endif

#define USB_CONFIG_SIZE (9 +                                                                  \
                         AUDIO_V2_AC_DESCRIPTOR_LEN +                                         \
                         AUDIO_V2_SIZEOF_AC_CLOCK_SOURCE_DESC +                               \
                         AUDIO_V2_SIZEOF_AC_INPUT_TERMINAL_DESC +                             \
                         AUDIO_V2_SIZEOF_AC_FEATURE_UNIT_DESC(USB_ADC_MIC_CHANNELS) +          \
                         AUDIO_V2_SIZEOF_AC_OUTPUT_TERMINAL_DESC +                            \
                         AUDIO_V2_AS_DESCRIPTOR_LEN)

#define AUDIO_AC_SIZ (AUDIO_V2_SIZEOF_AC_HEADER_DESC +                                      \
                      AUDIO_V2_SIZEOF_AC_CLOCK_SOURCE_DESC +                                \
                      AUDIO_V2_SIZEOF_AC_INPUT_TERMINAL_DESC +                              \
                      AUDIO_V2_SIZEOF_AC_FEATURE_UNIT_DESC(USB_ADC_MIC_CHANNELS) +           \
                      AUDIO_V2_SIZEOF_AC_OUTPUT_TERMINAL_DESC)

