oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
static const uint8_t device_descriptor[] =
{
    USB_DEVICE_DESCRIPTOR_INIT(USB_2_0, 0x00, 0x00, 0x00, USBD_VID, USBD_PID, 0x0001, 0x01)
};

static const uint8_t config_descriptor[] =
{
    USB_CONFIG_DESCRIPTOR_INIT(USB_CONFIG_SIZE, 0x02, 0x01, USB_CONFIG_BUS_POWERED, USBD_MAX_POWER),
    AUDIO_V2_AC_DESCRIPTOR_INIT(0x00, 0x02, AUDIO_AC_SIZ, AUDIO_CATEGORY_MICROPHONE, 0x00, 0x00),
    AUDIO_V2_AC_CLOCK_SOURCE_DESCRIPTOR_INIT(AUDIO_IN_CLOCK_ID, 0x01, 0x01),
    AUDIO_V2_AC_INPUT_TERMINAL_DESCRIPTOR_INIT(0x02, AUDIO_INTERM_MIC, AUDIO_IN_CLOCK_ID,
                                               USB_ADC_MIC_CHANNELS, INPUT_CH_ENABLE, 0x0000),
    AUDIO_V2_AC_FEATURE_UNIT_DESCRIPTOR_INIT(AUDIO_IN_FU_ID, 0x02, INPUT_CTRL),
    AUDIO_V2_AC_OUTPUT_TERMINAL_DESCRIPTOR_INIT(0x04, AUDIO_TERMINAL_STREAMING, AUDIO_IN_FU_ID,
                                                AUDIO_IN_CLOCK_ID, 0x0000),
    AUDIO_V2_AS_DESCRIPTOR_INIT(0x01, 0x04, USB_ADC_MIC_CHANNELS, INPUT_CH_ENABLE,
                                USB_ADC_MIC_BYTES_PER_SAMPLE, USB_ADC_MIC_BITS_PER_SAMPLE,
                                AUDIO_IN_EP, 0x05, USB_ADC_MIC_EP_MAX_PACKET_BYTES, EP_INTERVAL)
};

static const uint8_t device_quality_descriptor[] =
{
    0x0a,
    USB_DESCRIPTOR_TYPE_DEVICE_QUALIFIER,
    0x00,
    0x02,
    0x00,
    0x00,
    0x00,
    0x40,
    0x00,
    0x00,
};

static const char *string_descriptors[] =
{
    (const char[]){ 0x09, 0x04 },
    "RT-Thread",
    "FRDM-MCXN947 ADC MIC",
    "2026090504",
};

static const uint8_t mic_default_sampling_freq_table[] =
{
    AUDIO_SAMPLE_FREQ_NUM(1),
    AUDIO_SAMPLE_FREQ_4B(USB_ADC_MIC_SAMPLE_RATE),
    AUDIO_SAMPLE_FREQ_4B(USB_ADC_MIC_SAMPLE_RATE),
    AUDIO_SAMPLE_FREQ_4B(0x00),
};

static volatile bool s_hw_inited;
static volatile bool s_streaming;
static volatile bool s_ep_tx_busy;
static volatile bool s_usb_tx_worker_inited;
static uint8_t s_usb_busid;
static volatile uint32_t s_mic_sample_rate = USB_ADC_MIC_SAMPLE_RATE;

static uint8_t s_pcm_ring[USB_ADC_MIC_PCM_BLOCKS][USB_ADC_MIC_PACKET_BYTES];
static volatile uint8_t s_pcm_read;
static volatile uint8_t s_pcm_write;
static volatile uint8_t s_pcm_count;
static volatile uint32_t s_pcm_overruns;
#if !USB_ADC_MIC_USE_TEST_TONE
static volatile uint32_t s_usb_underruns;
#endif
static volatile bool s_usb_mute_state[USB_ADC_MIC_CHANNELS + 1U];
static volatile int s_usb_volume_db[USB_ADC_MIC_CHANNELS + 1U];
#if USB_ADC_MIC_USE_TEST_TONE
static uint32_t s_test_tone_phase[USB_ADC_MIC_CHANNELS];

static const uint32_t s_test_tone_step[USB_ADC_MIC_CHANNELS] =
{
    USB_ADC_MIC_TEST_TONE_PHASE_STEP(USB_ADC_MIC_TEST_TONE_HZ0),
    USB_ADC_MIC_TEST_TONE_PHASE_STEP(USB_ADC_MIC_TEST_TONE_HZ1),
    USB_ADC_MIC_TEST_TONE_PHASE_STEP(USB_ADC_MIC_TEST_TONE_HZ2)
};
#endif

static USB_NOCACHE_RAM_SECTION USB_MEM_ALIGNX uint8_t s_usb_tx_buffer[USB_ADC_MIC_PACKET_BYTES];
static struct rt_semaphore s_usb_tx_sem;
static struct rt_thread s_usb_tx_thread;
rt_align(RT_ALIGN_SIZE) static rt_uint8_t s_usb_tx_thread_stack[USB_ADC_MIC_TX_THREAD_STACK_SIZE];

AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc0_a_samples[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc1_a_samples[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc1_b_samples[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS], 4U);

EDMA_ALLOCATE_TCD(s_adc0_a_tcd, USB_ADC_MIC_DMA_BLOCKS);
EDMA_ALLOCATE_TCD(s_adc1_a_tcd, USB_ADC_MIC_DMA_BLOCKS);
EDMA_ALLOCATE_TCD(s_adc1_b_tcd, USB_ADC_MIC_DMA_BLOCKS);

static edma_handle_t s_dma_handle[USB_ADC_MIC_CHANNELS];
static edma_transfer_config_t s_dma_transfer[USB_ADC_MIC_CHANNELS][USB_ADC_MIC_DMA_BLOCKS];
static volatile uint32_t s_dma_done_count[USB_ADC_MIC_CHANNELS];
static volatile uint32_t s_mixed_count;

static const volatile uint32_t *const s_adc_sample_src[USB_ADC_MIC_CHANNELS] =
{
    &s_adc0_a_samples[0][0],
    &s_adc1_a_samples[0][0],
    &s_adc1_b_samples[0][0],
};

static const uint8_t *device_descriptor_callback(uint8_t speed)
{
    (void)speed;

    return device_descriptor;
}

static const uint8_t *config_descriptor_callback(uint8_t speed)
{
    (void)speed;

    return config_descriptor;
}

static const uint8_t *device_quality_descriptor_callback(uint8_t speed)
{
    (void)speed;

    return device_quality_descriptor;
}

static const char *string_descriptor_callback(uint8_t speed, uint8_t index)
{
    (void)speed;

    if (index >= (sizeof(string_descriptors) / sizeof(string_descriptors[0])))
    {
        return RT_NULL;
    }

    return string_descriptors[index];
}

static const struct usb_descriptor audio_v2_descriptor =
{
    .device_descriptor_callback = device_descriptor_callback,
    .config_descriptor_callback = config_descriptor_callback,
    .device_quality_descriptor_callback = device_quality_descriptor_callback,
    .string_descriptor_callback = string_descriptor_callback
};

static void usb_adc_mic_try_send(uint8_t busid);
static void usb_adc_mic_kick_tx(void);
static void usb_adc_mic_stop_stream(void);

static void usb_adc_mic_tx_thread_entry(void *parameter)
{
    (void)parameter;

    while (1)
    {
        if (rt_sem_take(&s_usb_tx_sem, RT_WAITING_FOREVER) == RT_EOK)
        {
            usb_adc_mic_try_send(s_usb_busid);
        }
    }
}

static bool usb_adc_mic_tx_worker_init(uint8_t busid)
{
    rt_err_t err;

    s_usb_busid = busid;
    if (s_usb_tx_worker_inited)
    {
        return true;
    }

    err = rt_sem_init(&s_usb_tx_sem, "uacm_tx", 0, RT_IPC_FLAG_FIFO);
    if (err != RT_EOK)
    {
        USB_LOG_ERR("ADC MIC TX sem init failed: %d\r\n", (int)err);
        return false;
    }

    err = rt_thread_init(&s_usb_tx_thread,
                         "uacm_tx",
                         usb_adc_mic_tx_thread_entry,
                         RT_NULL,
                         s_usb_tx_thread_stack,
                         sizeof(s_usb_tx_thread_stack),
                         USB_ADC_MIC_TX_THREAD_PRIORITY,
                         USB_ADC_MIC_TX_THREAD_TICK);
    if (err != RT_EOK)
    {
        USB_LOG_ERR("ADC MIC TX thread init failed: %d\r\n", (int)err);
        return false;
    }

    err = rt_thread_startup(&s_usb_tx_thread);
    if (err != RT_EOK)
    {
        USB_LOG_ERR("ADC MIC TX thread startup failed: %d\r\n", (int)err);
        return false;
    }

