oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
    s_usb_tx_worker_inited = true;
    return true;
}

static void usb_adc_mic_kick_tx(void)
{
    if (s_usb_tx_worker_inited)
    {
        (void)rt_sem_release(&s_usb_tx_sem);
    }
}

static void usb_adc_mic_ring_reset(void)
{
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    s_pcm_read = 0U;
    s_pcm_write = 0U;
    s_pcm_count = 0U;
    s_dma_done_count[0] = 0U;
    s_dma_done_count[1] = 0U;
    s_dma_done_count[2] = 0U;
    s_mixed_count = 0U;
    rt_hw_interrupt_enable(level);
}

static void usb_adc_mic_ring_push(const uint8_t *data)
{
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    if (s_pcm_count >= USB_ADC_MIC_PCM_BLOCKS)
    {
        s_pcm_read = (uint8_t)((s_pcm_read + 1U) % USB_ADC_MIC_PCM_BLOCKS);
        s_pcm_count--;
        s_pcm_overruns++;
    }

    memcpy(s_pcm_ring[s_pcm_write], data, USB_ADC_MIC_PACKET_BYTES);
    s_pcm_write = (uint8_t)((s_pcm_write + 1U) % USB_ADC_MIC_PCM_BLOCKS);
    s_pcm_count++;
    rt_hw_interrupt_enable(level);
}

#if !USB_ADC_MIC_USE_TEST_TONE
static bool usb_adc_mic_ring_pop(uint8_t *data)
{
    bool has_data = false;
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    if (s_pcm_count > 0U)
    {
        memcpy(data, s_pcm_ring[s_pcm_read], USB_ADC_MIC_PACKET_BYTES);
        s_pcm_read = (uint8_t)((s_pcm_read + 1U) % USB_ADC_MIC_PCM_BLOCKS);
        s_pcm_count--;
        has_data = true;
    }
    rt_hw_interrupt_enable(level);

    return has_data;
}
#endif

static int16_t usb_adc_mic_adc_to_pcm(uint32_t raw)
{
    uint16_t sample;

    sample = (uint16_t)(raw & ADC_RESFIFO_D_MASK);

    return (int16_t)((int32_t)sample - 32768);
}

static void usb_adc_mic_mix_block(uint32_t block)
{
    uint8_t pcm[USB_ADC_MIC_PACKET_BYTES];
    uint8_t *dst;

    dst = pcm;
    for (uint32_t i = 0U; i < USB_ADC_MIC_SAMPLES_PER_MS; i++)
    {
        for (uint32_t ch = 0U; ch < USB_ADC_MIC_CHANNELS; ch++)
        {
            const volatile uint32_t *src;
            int16_t sample;

            src = s_adc_sample_src[ch] + (block * USB_ADC_MIC_SAMPLES_PER_MS);
            sample = usb_adc_mic_adc_to_pcm(src[i]);
            *dst++ = (uint8_t)(sample & 0xff);
            *dst++ = (uint8_t)(((uint16_t)sample >> 8) & 0xff);
        }
    }

    usb_adc_mic_ring_push(pcm);
}

static uint32_t usb_adc_mic_min_done_count(void)
{
    uint32_t min_done;

    min_done = s_dma_done_count[0];
    if (s_dma_done_count[1] < min_done)
    {
        min_done = s_dma_done_count[1];
    }
    if (s_dma_done_count[2] < min_done)
    {
        min_done = s_dma_done_count[2];
    }

    return min_done;
}

static void usb_adc_mic_dma_callback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds)
{
    uint32_t dma_index;
    uint32_t done_blocks;

    (void)handle;

    dma_index = (uint32_t)(uintptr_t)userData;
    if (dma_index >= USB_ADC_MIC_CHANNELS)
    {
        return;
    }
    if (!s_streaming)
    {
        return;
    }

    done_blocks = tcds;
    if (done_blocks == 0U)
    {
        if (!transferDone)
        {
            return;
        }
        done_blocks = 1U;
    }

    s_dma_done_count[dma_index] += done_blocks;
    while (s_mixed_count < usb_adc_mic_min_done_count())
    {
        uint32_t block;

        block = s_mixed_count % USB_ADC_MIC_DMA_BLOCKS;
        usb_adc_mic_mix_block(block);
        s_mixed_count++;
    }
}

static void usb_adc_mic_prepare_dma_ring(edma_handle_t *handle,
                                         edma_transfer_config_t *transfer,
                                         edma_tcd_t *tcd,
                                         uint32_t channel,
                                         int32_t request,
                                         const volatile uint32_t *fifo,
                                         volatile uint32_t raw[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS],
                                         void *callback_user_data)
{
    EDMA_CreateHandle(handle, DMA0, channel);
    EDMA_InstallTCDMemory(handle, tcd, USB_ADC_MIC_DMA_BLOCKS);
    EDMA_SetChannelMux(DMA0, channel, request);
    EDMA_SetCallback(handle, usb_adc_mic_dma_callback, callback_user_data);

    for (uint32_t i = 0U; i < USB_ADC_MIC_DMA_BLOCKS; i++)
    {
        EDMA_PrepareTransfer(&transfer[i],
                             (void *)fifo,
                             sizeof(uint32_t),
                             (void *)&raw[i][0],
                             sizeof(uint32_t),
                             sizeof(uint32_t),
                             sizeof(raw[i]),
                             kEDMA_PeripheralToMemory);
    }
}

/* Only reachable from usb_adc_mic_start_stream()'s #if !USB_ADC_MIC_USE_TEST_TONE
 * block, so wrap the definition to match - otherwise armcc warns about an unused
 * static function. */
#if !USB_ADC_MIC_USE_TEST_TONE
static bool usb_adc_mic_start_dma_ring(edma_handle_t *handle, edma_transfer_config_t *transfer)
{
    status_t status;

    EDMA_AbortTransfer(handle);
    status = EDMA_SubmitLoopTransfer(handle, transfer, USB_ADC_MIC_DMA_BLOCKS);
    if (status != kStatus_Success)
    {
        USB_LOG_ERR("ADC mic EDMA submit failed: %d\r\n", (int)status);
        return false;
    }

    EDMA_StartTransfer(handle);

    return true;
}
#endif

static void usb_adc_mic_init_opamp(OPAMP_Type *base)
{
    opamp_config_t config;

    OPAMP_GetDefaultConfig(&config);
    config.enable = true;
    config.mode = kOPAMP_LowNoiseMode;
    config.posGain = USB_ADC_MIC_OPAMP_GAIN;
    config.negGain = kOPAMP_NegGainBufferMode;
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_OUTSW) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_OUTSW
    config.enableOutputSwitch = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW1) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW1
    config.enablePosADCSw1 = true;
#else
    config.enablePosADCSw = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW2) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_ADCSW2
    config.enablePosADCSw2 = true;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_BUFEN) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_BUFEN
    config.enableRefBuffer = ((uint32_t)USB_ADC_MIC_OPAMP_GAIN <= 7U);
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_INPSEL) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_INPSEL
    config.PosInputChannelSelection = kOPAMP_PosInputChannel0;
#endif
#if defined(FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_TRIGMD) && FSL_FEATURE_OPAMP_HAS_OPAMP_CTR_TRIGMD
    config.enableTriggerMode = false;
#endif

    OPAMP_Init(base, &config);
}

static void usb_adc_mic_config_adc_pins(void)
{
    const port_pin_config_t adc0_a2_config = {
        kPORT_PullDisable,
        kPORT_LowPullResistor,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable,
        kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength,
        kPORT_MuxAlt0,
        kPORT_InputBufferDisable,
        kPORT_InputNormal,
        kPORT_UnlockRegister,
    };

