oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
#if USB_ADC_MIC_USE_OPAMP
    usb_adc_mic_init_opamp(OPAMP0);
    usb_adc_mic_init_opamp(OPAMP1);
    usb_adc_mic_init_opamp(OPAMP2);
#endif

    usb_adc_mic_config_adc_pins();
    usb_adc_mic_init_lpadc(ADC0);
    usb_adc_mic_init_lpadc(ADC1);
    usb_adc_mic_config_adc0();
    usb_adc_mic_config_adc1();
    usb_adc_mic_config_ctimer();

    usb_adc_mic_prepare_dma_ring(&s_dma_handle[0], &s_dma_transfer[0][0], s_adc0_a_tcd,
                                 USB_ADC_MIC_DMA_CHANNEL_ADC0_A, kDma0RequestMuxAdc0FifoARequest,
                                 &ADC0->RESFIFO[0], s_adc0_a_samples, (void *)(uintptr_t)0U);
    usb_adc_mic_prepare_dma_ring(&s_dma_handle[1], &s_dma_transfer[1][0], s_adc1_a_tcd,
                                 USB_ADC_MIC_DMA_CHANNEL_ADC1_A, kDma0RequestMuxAdc1FifoARequest,
                                 &ADC1->RESFIFO[0], s_adc1_a_samples, (void *)(uintptr_t)1U);
    usb_adc_mic_prepare_dma_ring(&s_dma_handle[2], &s_dma_transfer[2][0], s_adc1_b_tcd,
                                 USB_ADC_MIC_DMA_CHANNEL_ADC1_B, kDma0RequestMuxAdc1FifoBRequest,
                                 &ADC1->RESFIFO[1], s_adc1_b_samples, (void *)(uintptr_t)2U);

    s_hw_inited = true;
}

static bool usb_adc_mic_start_stream(void)
{
    if (!s_hw_inited)
    {
        usb_adc_mic_hw_init();
    }

    usb_adc_mic_stop_stream();
    usb_adc_mic_ring_reset();
    memset(s_usb_tx_buffer, 0, sizeof(s_usb_tx_buffer));
#if USB_ADC_MIC_USE_TEST_TONE
    for (uint32_t ch = 0; ch < USB_ADC_MIC_CHANNELS; ch++)
    {
        s_test_tone_phase[ch] = 0U;
    }
#endif

    LPADC_DoResetFIFO0(ADC0);
    LPADC_DoResetFIFO0(ADC1);
    LPADC_DoResetFIFO1(ADC1);

/* In test tone mode the samples come from sine_16pt[] straight into
 * s_usb_tx_buffer, so nothing reads the ADC DMA destination buffers. The three
 * EDMA_SubmitLoopTransfer() calls must not be allowed to veto streaming: each
 * was one failure that killed the whole stream.
 *
 * CTIMER is intentionally left running. No LPADC interrupt is enabled anywhere
 * in this file, so the undrained ADC FIFOs just overflow silently, and leaving
 * it running also means usb_adc_mic_stop_stream() needs no changes. */
#if !USB_ADC_MIC_USE_TEST_TONE
    if (!usb_adc_mic_start_dma_ring(&s_dma_handle[0], &s_dma_transfer[0][0]))
    {
        return false;
    }
    if (!usb_adc_mic_start_dma_ring(&s_dma_handle[1], &s_dma_transfer[1][0]))
    {
        EDMA_AbortTransfer(&s_dma_handle[0]);
        return false;
    }
    if (!usb_adc_mic_start_dma_ring(&s_dma_handle[2], &s_dma_transfer[2][0]))
    {
        EDMA_AbortTransfer(&s_dma_handle[0]);
        EDMA_AbortTransfer(&s_dma_handle[1]);
        return false;
    }
#endif

    s_streaming = true;
    s_ep_tx_busy = false;
    CTIMER_Reset(CTIMER0);
    CTIMER_StartTimer(CTIMER0);

    return true;
}

static void usb_adc_mic_stop_stream(void)
{
    if (!s_hw_inited)
    {
        return;
    }

    s_streaming = false;
    CTIMER_StopTimer(CTIMER0);
    EDMA_AbortTransfer(&s_dma_handle[0]);
    EDMA_AbortTransfer(&s_dma_handle[1]);
    EDMA_AbortTransfer(&s_dma_handle[2]);
    LPADC_DoResetFIFO0(ADC0);
    LPADC_DoResetFIFO0(ADC1);
    LPADC_DoResetFIFO1(ADC1);

    s_ep_tx_busy = false;
}

#if USB_ADC_MIC_USE_TEST_TONE
static const int16_t sine_16pt[USB_ADC_MIC_TEST_TONE_TABLE_SIZE] =
{
    0, 7654, 14142, 18478,
    20000, 18478, 14142, 7654,
    0, -7654, -14142, -18478,
    -20000, -18478, -14142, -7654
};

static int16_t usb_adc_mic_next_test_sample(uint32_t ch)
{
    uint32_t index;
    int16_t sample;

    index = s_test_tone_phase[ch] >> USB_ADC_MIC_TEST_TONE_PHASE_SHIFT;
    sample = sine_16pt[index & (USB_ADC_MIC_TEST_TONE_TABLE_SIZE - 1U)];
    s_test_tone_phase[ch] += s_test_tone_step[ch];

    return sample;
}

static void usb_adc_mic_fill_test_tone(uint8_t *buffer)
{
    uint8_t *p = buffer;

    for (uint32_t i = 0; i < USB_ADC_MIC_SAMPLES_PER_MS; i++)
    {
        /* Frame layout stays ch0, ch1, ch2 interleaved, same as the ADC path. */
        for (uint32_t ch = 0; ch < USB_ADC_MIC_CHANNELS; ch++)
        {
            int16_t sample = usb_adc_mic_next_test_sample(ch);

            *p++ = (uint8_t)(sample & 0xff);
            *p++ = (uint8_t)(((uint16_t)sample >> 8) & 0xff);
        }
    }
}
#endif

static void usb_adc_mic_try_send(uint8_t busid)
{
    int ret;

    if (!s_streaming)
    {
        return;
    }
    if (s_ep_tx_busy)
    {
        return;
    }

#if USB_ADC_MIC_USE_TEST_TONE
    usb_adc_mic_fill_test_tone(s_usb_tx_buffer);
#else
    if (!usb_adc_mic_ring_pop(s_usb_tx_buffer))
    {
        memset(s_usb_tx_buffer, 0, sizeof(s_usb_tx_buffer));
        s_usb_underruns++;
    }
#endif

    s_ep_tx_busy = true;
    ret = usbd_ep_start_write(busid, AUDIO_IN_EP, s_usb_tx_buffer, sizeof(s_usb_tx_buffer));
    if (ret < 0)
    {
        s_ep_tx_busy = false;
#if USB_ADC_MIC_USE_TEST_TONE
        /* Roll every channel's phase back: fill_test_tone() above already
         * consumed one packet's worth of samples, but nothing actually went
         * out. Without this each failed submit drops 16 samples and the tone
         * drifts. uint32_t wraparound is fine - the DDS only uses phase
         * mod 2^32. */
        for (uint32_t ch = 0; ch < USB_ADC_MIC_CHANNELS; ch++)
        {
            s_test_tone_phase[ch] -= USB_ADC_MIC_SAMPLES_PER_MS * s_test_tone_step[ch];
        }
#endif
    }
}

static void usbd_event_handler(uint8_t busid, uint8_t event)
{
    (void)busid;

    switch (event)
    {
    case USBD_EVENT_RESET:
    case USBD_EVENT_DISCONNECTED:
    case USBD_EVENT_SUSPEND:
        usb_adc_mic_stop_stream();
        break;
    default:
        break;
    }
}

void usbd_audio_open(uint8_t busid, uint8_t intf)
{
    if (intf != 1U)
    {
        return;
    }

    if (usb_adc_mic_start_stream())
    {
        USB_LOG_RAW("ADC MIC OPEN\r\n");
        /* PORTSC1's PSPD is only set by the HS chirp, which has certainly
         * happened by the time the host sends SET_INTERFACE - printing it at
         * component-init time just reports the reset value 0x00, which this
         * port maps to full speed. USB_SPEED_LOW=1, FULL=2, HIGH=3 (usb_def.h).
         * Expect 3: a 2 (full speed) would make EP_INTERVAL 0x03 mean 3 ms of
         * interval for 1 ms of audio. */
        USB_LOG_RAW("ADC MIC port speed: %u\r\n", (unsigned)usbd_get_port_speed(busid));
        usb_adc_mic_kick_tx();
    }
    else
    {
        /* Silence with no "ADC MIC OPEN" line means the host never issued
         * SetInterface(1,1) and this function was never reached. */
        USB_LOG_ERR("ADC MIC OPEN failed: stream start failed\r\n");
    }
}

void usbd_audio_close(uint8_t busid, uint8_t intf)
{
    (void)busid;

