oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
    if (intf != 1U)
    {
        return;
    }

    USB_LOG_RAW("ADC MIC CLOSE\r\n");
    usb_adc_mic_stop_stream();
}

void usbd_audio_set_sampling_freq(uint8_t busid, uint8_t ep, uint32_t sampling_freq)
{
    (void)busid;

    if (ep == AUDIO_IN_EP)
    {
        if (sampling_freq != USB_ADC_MIC_SAMPLE_RATE)
        {
            USB_LOG_ERR("ADC MIC only supports %u Hz\r\n", USB_ADC_MIC_SAMPLE_RATE);
        }
        s_mic_sample_rate = USB_ADC_MIC_SAMPLE_RATE;
    }
}

uint32_t usbd_audio_get_sampling_freq(uint8_t busid, uint8_t ep)
{
    (void)busid;

    if (ep == AUDIO_IN_EP)
    {
        return s_mic_sample_rate;
    }

    return 0U;
}

void usbd_audio_get_sampling_freq_table(uint8_t busid, uint8_t ep, uint8_t **sampling_freq_table)
{
    (void)busid;

    if (ep == AUDIO_IN_EP)
    {
        *sampling_freq_table = (uint8_t *)mic_default_sampling_freq_table;
    }
}

void usbd_audio_set_volume(uint8_t busid, uint8_t ep, uint8_t ch, int volume_db)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        s_usb_volume_db[ch] = volume_db;
    }
}

int usbd_audio_get_volume(uint8_t busid, uint8_t ep, uint8_t ch)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        return s_usb_volume_db[ch];
    }

    return 0;
}

void usbd_audio_set_mute(uint8_t busid, uint8_t ep, uint8_t ch, bool mute)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        s_usb_mute_state[ch] = mute;
    }
}

bool usbd_audio_get_mute(uint8_t busid, uint8_t ep, uint8_t ch)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        return s_usb_mute_state[ch];
    }

    return false;
}

void usbd_audio_iso_in_callback(uint8_t busid, uint8_t ep, uint32_t nbytes)
{
    (void)busid;
    (void)nbytes;

    if (ep != AUDIO_IN_EP)
    {
        return;
    }

    s_ep_tx_busy = false;
    usb_adc_mic_kick_tx();
}

static struct usbd_endpoint audio_in_ep =
{
    .ep_cb = usbd_audio_iso_in_callback,
    .ep_addr = AUDIO_IN_EP
};

static struct usbd_interface intf0;
static struct usbd_interface intf1;

static struct audio_entity_info audio_entity_table[] =
{
    {
        .bEntityId = AUDIO_IN_CLOCK_ID,
        .bDescriptorSubtype = AUDIO_CONTROL_CLOCK_SOURCE,
        .ep = AUDIO_IN_EP
    },
    {
        .bEntityId = AUDIO_IN_FU_ID,
        .bDescriptorSubtype = AUDIO_CONTROL_FEATURE_UNIT,
        .ep = AUDIO_IN_EP
    },
};

void usb_adc_mic_init(uint8_t busid, uintptr_t reg_base)
{
    s_mic_sample_rate = USB_ADC_MIC_SAMPLE_RATE;

    usb_adc_mic_hw_init();
    (void)usb_adc_mic_tx_worker_init(busid);

    usbd_desc_register(busid, &audio_v2_descriptor);
    usbd_add_interface(busid, usbd_audio_init_intf(busid, &intf0, 0x0200, audio_entity_table, 2));
    usbd_add_interface(busid, usbd_audio_init_intf(busid, &intf1, 0x0200, audio_entity_table, 2));
    usbd_add_endpoint(busid, &audio_in_ep);
    usbd_initialize(busid, reg_base, usbd_event_handler);
}

#endif
